import React from "react";
import { IconProps, IconWrapper } from ".";

/** 수익 포인트(P). 테두리 원 안에 P 를 둔 동전 모양. */
const Coin = (props: IconProps) => {
  return (
    <IconWrapper {...props}>
      <path
        fillRule="evenodd"
        d="M12 2C17.5228 2 22 6.47715 22 12C22 17.5228 17.5228 22 12 22C6.47715 22 2 17.5228 2 12C2 6.47715 6.47715 2 12 2ZM12 3.39535C7.24778 3.39535 3.39535 7.24778 3.39535 12C3.39535 16.7522 7.24778 20.6047 12 20.6047C16.7522 20.6047 20.6047 16.7522 20.6047 12C20.6047 7.24778 16.7522 3.39535 12 3.39535Z"
      />
      <path d="M9.4 7.5H10.8V16.5H9.4V7.5Z" />
      <path
        fillRule="evenodd"
        d="M10.8 7.5H13.1C14.7016 7.5 16 8.79837 16 10.4C16 12.0016 14.7016 13.3 13.1 13.3H10.8V11.9H13.1C13.9284 11.9 14.6 11.2284 14.6 10.4C14.6 9.57157 13.9284 8.9 13.1 8.9H10.8V7.5Z"
      />
    </IconWrapper>
  );
};

export default Coin;
